In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv("Campus_Placement_Tracker_500.csv")

In [3]:
dataframe

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
0,22BCE6764,Shruti,Gupta,Female,Civil,Capgemini,3.43,Software Engineer
1,22BCE1856,Dev,Sharma,Male,Mechanical,Cognizant,5.63,Data Analyst
2,22BCE7769,Dev,Pandey,Male,ECE,TCS,4.17,Software Engineer
3,22BCE3591,Atharv,Mehta,Female,ECE,Infosys,3.42,DevOps Engineer
4,22BCE2533,Sai,Agarwal,Male,Civil,TCS,3.14,DevOps Engineer
...,...,...,...,...,...,...,...,...
495,22BCE9836,Aarav,Verma,Male,EEE,Google,21.62,Backend Developer
496,22BCE3684,Dev,Joshi,Female,Civil,Wipro,13.19,Data Analyst
497,22BCE3357,Ishaan,Reddy,Female,Civil,Google,12.04,DevOps Engineer
498,22BCE6715,Kritika,Kapoor,Male,IT,TCS,20.80,System Analyst
499,22BCE7062,Arjun,Kapoor,Male,Mechanical,Google,22.68,System Analyst

In [4]:
dataframe.head(10)

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
0,22BCE6764,Shruti,Gupta,Female,Civil,Capgemini,3.43,Software Engineer
1,22BCE1856,Dev,Sharma,Male,Mechanical,Cognizant,5.63,Data Analyst
2,22BCE7769,Dev,Pandey,Male,ECE,TCS,4.17,Software Engineer
3,22BCE3591,Atharv,Mehta,Female,ECE,Infosys,3.42,DevOps Engineer
4,22BCE2533,Sai,Agarwal,Male,Civil,TCS,3.14,DevOps Engineer
5,22BCE5451,Saanvi,Pandey,Female,CSE,Amazon,5.92,Software Engineer
6,22BCE2600,Aryan,Reddy,Female,IT,Cognizant,4.41,Backend Developer
7,22BCE3414,Harsh,Singh,Female,Mechanical,Infosys,4.71,DevOps Engineer
8,22BCE9616,Ananya,Kapoor,Male,Mechanical,Microsoft,4.93,Software Engineer
9,22BCE4193,Kiara,Kumar,Male,Civil,Infosys,5.31,Software Engineer

In [5]:
pd.options.display.max_rows

60

In [7]:
pd.options.display.min_rows

10

In [8]:
dataframe.tail(10)

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
490,22BCE2689,Laksh,Ghosh,Male,Civil,Infosys,17.99,Web Developer
491,22BCE8865,Trisha,Das,Male,ECE,Amazon,20.34,System Analyst
492,22BCE8218,Dev,Nair,Male,IT,Wipro,8.13,Web Developer
493,22BCE7871,Krishna,Das,Male,Mechanical,Cognizant,21.34,Web Developer
494,22BCE2099,Riya,Pandey,Female,Civil,TCS,14.67,Software Engineer
495,22BCE9836,Aarav,Verma,Male,EEE,Google,21.62,Backend Developer
496,22BCE3684,Dev,Joshi,Female,Civil,Wipro,13.19,Data Analyst
497,22BCE3357,Ishaan,Reddy,Female,Civil,Google,12.04,DevOps Engineer
498,22BCE6715,Kritika,Kapoor,Male,IT,TCS,20.80,System Analyst
499,22BCE7062,Arjun,Kapoor,Male,Mechanical,Google,22.68,System Analyst

In [10]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll Number  500 non-null    object
 1   First Name   500 non-null    object
 2   Last Name    500 non-null    object
 3   Gender       500 non-null    object
 4   Branch       500 non-null    object
 5   Company      500 non-null    object
 6   CTC (LPA)    500 non-null    float64
 7   Job Role     500 non-null    object
dtypes: float64(1), object(7)
memory usage: 31.4+ KB

In [11]:
dataframe.describe()

        CTC (LPA)
count  500.000000
mean    11.171580
std      8.446694
min      3.000000
25%      4.507500
50%      5.990000
75%     18.000000
max     29.920000

In [12]:
dataframe.describe(include="O")

,Roll Number,First Name,Last Name,Gender,Branch,Company,Job Role
count,500,500,500,500,500,500,500
unique,489,40,20,2,6,8,6
top,22BCE1478,Kabir,Chopra,Female,CSE,Microsoft,Software Engineer
freq,2,23,38,256,97,77,89

In [13]:
min(dataframe)

'Branch'

# Data Frame Attributes

In [15]:
dataframe.shape

(500, 8)

In [16]:
dataframe.size

4000

In [18]:
dataframe.index

RangeIndex(start=0, stop=500, step=1)

In [20]:
dataframe.columns

Index(['Roll Number', 'First Name', 'Last Name', 'Gender', 'Branch', 'Company',
       'CTC (LPA)', 'Job Role'],
      dtype='object')

# Data Frame Methods

In [21]:
dataframe.head

<bound method NDFrame.head of     Roll Number First Name Last Name  Gender      Branch    Company  \
0     22BCE6764     Shruti     Gupta  Female       Civil  Capgemini
1     22BCE1856        Dev    Sharma    Male  Mechanical  Cognizant
2     22BCE7769        Dev    Pandey    Male         ECE        TCS
3     22BCE3591     Atharv     Mehta  Female         ECE    Infosys
4     22BCE2533        Sai   Agarwal    Male       Civil        TCS
..          ...        ...       ...     ...         ...        ...
495   22BCE9836      Aarav     Verma    Male         EEE     Google
496   22BCE3684        Dev     Joshi  Female       Civil      Wipro
497   22BCE3357     Ishaan     Reddy  Female       Civil     Google
498   22BCE6715    Kritika    Kapoor    Male          IT        TCS
499   22BCE7062      Arjun    Kapoor    Male  Mechanical     Google

     CTC (LPA)           Job Role
0         3.43  Software Engineer
1         5.63       Data Analyst
2         4.17  Software Engineer
3         3.42    DevOps Engineer
4         3.14    DevOps Engineer
..         ...                ...
495      21.62  Backend Developer
496      13.19       Data Analyst
497      12.04    DevOps Engineer
498      20.80     System Analyst
499      22.68     System Analyst

[500 rows x 8 columns]>

In [22]:
dataframe.info

<bound method DataFrame.info of     Roll Number First Name Last Name  Gender      Branch    Company  \
0     22BCE6764     Shruti     Gupta  Female       Civil  Capgemini
1     22BCE1856        Dev    Sharma    Male  Mechanical  Cognizant
2     22BCE7769        Dev    Pandey    Male         ECE        TCS
3     22BCE3591     Atharv     Mehta  Female         ECE    Infosys
4     22BCE2533        Sai   Agarwal    Male       Civil        TCS
..          ...        ...       ...     ...         ...        ...
495   22BCE9836      Aarav     Verma    Male         EEE     Google
496   22BCE3684        Dev     Joshi  Female       Civil      Wipro
497   22BCE3357     Ishaan     Reddy  Female       Civil     Google
498   22BCE6715    Kritika    Kapoor    Male          IT        TCS
499   22BCE7062      Arjun    Kapoor    Male  Mechanical     Google

     CTC (LPA)           Job Role
0         3.43  Software Engineer
1         5.63       Data Analyst
2         4.17  Software Engineer
3         3.42    DevOps Engineer
4         3.14    DevOps Engineer
..         ...                ...
495      21.62  Backend Developer
496      13.19       Data Analyst
497      12.04    DevOps Engineer
498      20.80     System Analyst
499      22.68     System Analyst

[500 rows x 8 columns]>

In [23]:
dataframe.min(numeric_only=True)

CTC (LPA)    3.0
dtype: float64

# Method Chaining

In [25]:
dataframe.mean(numeric_only=True)

CTC (LPA)    11.17158
dtype: float64